modules/server/freemacs-server.org
# -*-eval: (add-hook 'after-save-hook (lambda ()(org-babel-tangle)) nil t);-*-

#+title: Server Module
#+author: Thomas Freeman
#+date: Time-stamp: <2022-07-07 18:48:27 thomas>
#+language: en_US
#+property: header-args :results silent :exports code

#+options: html-link-use-abs-url:nil html-postamble:auto
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t num:nil toc:t
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+keywords: Emacs
#+html_link_home: ../../index.html
#+html_link_up: ../../init.html
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)
#+html_head: <style>#org-div-home-and-up { text-align: right; padding-right: 10pt; }</style>

#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup


Running Emacs as a server means that if I create a new instance of Emacs with the command ~emacs~, I can then use the command ~emacsclient -c -n~ in order to quickly open a new Emacs buffer that is part of the same Emacs session.

* Start Emacs Server

I have this option run only when I am not executing Emacs as a portable app as it is unlikely that there will be Emacs installed on the system that I am running Emacs on when I am using it as a portable application.

#+begin_src emacs-lisp :tangle yes :noweb yes
  ;; Start an Emacs server

  (use-package server
    :straight (:type built-in)
    :if (not (freemacs/isportable-p))
    :config
    (unless (server-running-p)
      (server-start)))
#+end_src


* End

Tell Emacs what package this file provides.
 
#+begin_src emacs-lisp :tangle yes
  (provide 'freemacs-server)
#+end_src
