docs/modules/server/freemacs-server.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en_US" xml:lang="en_US">
  <head>
    <!-- 2022-07-21 Thu 18:26 -->
    <meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <title>Server Module</title>
    <meta name="author" content="Thomas Freeman" />
    <meta name="keywords" content="Emacs" />
    <meta name="generator" content="Org Mode" />
    <link
      rel="stylesheet"
      type="text/css"
      href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"
    />
    <link
      rel="stylesheet"
      type="text/css"
      href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"
    />
  </head>
  <body>
    <div id="org-div-home-and-up">
      <a accesskey="h" href="../../init.html"> UP </a>
      |
      <a accesskey="H" href="../../index.html"> HOME </a>
    </div>
    <div id="content" class="content">
      <h1 class="title">Server Module</h1>
      <div id="table-of-contents" role="doc-toc">
        <h2>Table of Contents</h2>
        <div id="text-table-of-contents" role="doc-toc">
          <ul>
            <li><a href="#org7260016">Start Emacs Server</a></li>
            <li><a href="#org1186763">End</a></li>
          </ul>
        </div>
      </div>
      <hr />

      <p>
        Running Emacs as a server means that if I create a new instance of Emacs
        with the command <code>emacs</code>, I can then use the command
        <code>emacsclient -c -n</code> in order to quickly open a new Emacs
        buffer that is part of the same Emacs session.
      </p>

      <div id="outline-container-org7260016" class="outline-2">
        <h2 id="org7260016">Start Emacs Server</h2>
        <div class="outline-text-2" id="text-org7260016">
          <p>
            I have this option run only when I am not executing Emacs as a
            portable app as it is unlikely that there will be Emacs installed on
            the system that I am running Emacs on when I am using it as a
            portable application.
          </p>

          <div class="org-src-container">
            <pre
              class="src src-emacs-lisp"
            ><span style="color: #546A90;">;; </span><span style="color: #546A90;">Start an Emacs server</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">server</span>
  <span style="color: #1ea8fc;">:straight</span> <span style="color: #ff2afc;">(</span><span style="color: #1ea8fc;">:type</span> built-in<span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:if</span> <span style="color: #ff2afc;">(</span>not <span style="color: #a7da1e;">(</span>freemacs/isportable-p<span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:config</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">unless</span> <span style="color: #a7da1e;">(</span>server-running-p<span style="color: #a7da1e;">)</span>
    <span style="color: #a7da1e;">(</span>server-start<span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
          </div>
        </div>
      </div>

      <div id="outline-container-org1186763" class="outline-2">
        <h2 id="org1186763">End</h2>
        <div class="outline-text-2" id="text-org1186763">
          <p>Tell Emacs what feature this file provides.</p>

          <div class="org-src-container">
            <pre
              class="src src-emacs-lisp"
            ><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">provide</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-server</span><span style="color: #1ea8fc;">)</span>
</pre>
          </div>
        </div>
      </div>
    </div>
    <div id="postamble" class="status">
      <p class="date">
        Date: Time-stamp:
        <span class="timestamp-wrapper"
          ><span class="timestamp">&lt;2022-07-21 Thu 18:25&gt;</span></span
        >
      </p>
      <p class="author">Author: Thomas Freeman</p>
      <p class="date">Created: 2022-07-21 Thu 18:26</p>
      <p class="validation">
        <a href="https://validator.w3.org/check?uri=referer">Validate</a>
      </p>
    </div>
  </body>
</html>
